﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2012, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//**********************************************************************

//<AMI_FHDR_START>
//----------------------------------------------------------------------------
//
// Name:        Sb.uni
//
// Description:	South Bridge setup string definitions 
//
//----------------------------------------------------------------------------
//<AMI_FHDR_END>

/=#
#include "VFR.uni"
#string STR_SB_FORM                     #language eng "South Bridge"
#string STR_SB_FORM_HELP                #language eng "South Bridge Parameters"

//---------------------------------------------------------------------------
// LPSS & SCC Configuration
//---------------------------------------------------------------------------
#string STR_LPSS_SCC_CONFIG_FORM        #language eng "LPSS & SCC Configuration"
#string STR_LPSS_SCC_CONFIG_FORM_HELP   #language eng "LPSS & SCC Configuration Setting"

#string STR_LPSS_SCC_DEVICE_MODE_PROMPT #language eng "LPSS & SCC Devices Mode"
#string STR_LPSS_SCC_DEVICE_MODE_HELP   #language eng "LPSS & SCC Devices Mode Settings"

#string STR_OS_SELECT_PROMPT            #language eng "OS Selection"
#string STR_OS_SELECT_HELP              #language eng "OS Selection"
#string STR_COMMON_WIN8                 #language eng "Windows 8.X"
#string STR_COMMON_ANDROID              #language eng "Android"
#string STR_COMMON_WIN7                 #language eng "Windows 7"

#string STR_LPSS_SCC_DEVICE_MODE_ACPI   #language eng "ACPI mode"
#string STR_LPSS_SCC_DEVICE_MODE_PCI    #language eng "PCI mode"

#string STR_SCC_CONFIG_TITLE   					#language eng "SCC Configuration"
#string STR_SCC_EMMC_PROMPT   					#language eng "SCC eMMC Support"
#string STR_SCC_EMMC_HELP   						#language eng "SCC eMMC Support Enable\Disable"
#string STR_SCC_SDIO_PROMPT  						#language eng "SCC SDIO Support"
#string STR_SCC_SDIO_HELP   						#language eng "SCC SDIO Support Enable\Disable"
#string STR_SCC_SD_CARD_PROMPT   				#language eng "SCC SD Card Support"
#string STR_SCC_SD_CARD_HELP   					#language eng "SCC SD Card Support Enable\Disable"
#string STR_MIPI_HSI_PROMPT   					#language eng "MIPI HSI Support"
#string STR_MIPI_HSI_HELP   						#language eng "MIPI HSI Support Enable\Disable"

//EIP144689 >>
// SD card DDR50 and SD25
#string STR_SCC_SD_SDR25_PROMPT                       #language eng "SDR25 Support for SDCard"
#string STR_SCC_SD_SDR25_HELP                         #language eng "Disable/Enable SDR25 Capability in SD Card controller"
#string STR_SCC_SD_DDR50_PROMPT                       #language eng "DDR50 Support for SDCard"
#string STR_SCC_SD_DDR50_HELP                         #language eng "Disable/Enable DDR50 Capability in SD Card controller"
//EIP144689 <<

#string STR_SCC_EMMC45_PROMPT   					#language eng "Enable eMMC 4.5 Support"
#string STR_SCC_EMMC441_PROMPT   					#language eng "Enable eMMC 4.41 Support"
#string STR_SCC_EMMC_AUTO   						#language eng "eMMC AUTO MODE"
#string STR_SCC_EMMC45DDR50_PROMPT   			#language eng "SCC eMMC 4.5 DDR50 Support"
#string STR_SCC_EMMC45DDR50_HELP   				#language eng "SCC eMMC 4.5 DDR50 Support Enable\Disable"
#string STR_SCC_EMMC45HS200_PROMPT   			#language eng "SCC eMMC 4.5 HS200 Support"
#string STR_SCC_EMMC45HS200_HELP   				#language eng "SCC eMMC 4.5 HS200 Support Enable\Disable"
#string STR_SCC_SECURE_ERASE_PROMPT                             #language eng "eMMC Secure Erase"
#string STR_SCC_SECURE_ERASE_HELP                               #language eng "Disable/Enable eMMC Secure Erase. When enabled, all the data on eMMC will be erased."

#string STR_LPSS_CONFIG_TITLE   				#language eng "LPSS Configuration"
#string STR_LPSS_DMA1_PROMPT   					#language eng "LPSS DMA #1 Support"
#string STR_LPSS_DMA1_HELP   						#language eng "LPSS DMA #1 Support Enable\Disable"
#string STR_LPSS_DMA2_PROMPT   					#language eng "LPSS DMA #2 Support"
#string STR_LPSS_DMA2_HELP   						#language eng "LPSS DMA #2 Support Enable\Disable"
#string STR_LPSS_I2C1_PROMPT   					#language eng "LPSS I2C #1 Support"
#string STR_LPSS_I2C1_HELP   						#language eng "LPSS I2C #1 Support Enable\Disable"
#string STR_LPSS_I2C2_PROMPT   					#language eng "LPSS I2C #2 Support"
#string STR_LPSS_I2C2_HELP   						#language eng "LPSS I2C #2 Support Enable\Disable"
#string STR_LPSS_I2C3_PROMPT   					#language eng "LPSS I2C #3 Support"
#string STR_LPSS_I2C3_HELP   						#language eng "LPSS I2C #3 Support Enable\Disable"
#string STR_LPSS_I2C4_PROMPT   					#language eng "LPSS I2C #4 Support"
#string STR_LPSS_I2C4_HELP   						#language eng "LPSS I2C #4 Support Enable\Disable"
#string STR_LPSS_I2C5_PROMPT   					#language eng "LPSS I2C #5 Support"
#string STR_LPSS_I2C5_HELP   						#language eng "LPSS I2C #5 Support Enable\Disable"
#string STR_LPSS_I2C6_PROMPT   					#language eng "LPSS I2C #6 Support"
#string STR_LPSS_I2C6_HELP   						#language eng "LPSS I2C #6 Support Enable\Disable"
#string STR_LPSS_I2C7_PROMPT   					#language eng "LPSS I2C #7 Support"
#string STR_LPSS_I2C7_HELP   						#language eng "LPSS I2C #7 Support Enable\Disable"
#string STR_LPSS_HSUART1_PROMPT   			#language eng "LPSS HSUART #1 Support"
#string STR_LPSS_HSUART1_HELP   				#language eng "LPSS HSUART #1 Support  Enable\Disable"
#string STR_LPSS_HSUART2_PROMPT   			#language eng "LPSS HSUART #2 Support"
#string STR_LPSS_HSUART2_HELP   				#language eng "LPSS HSUART #2 Support  Enable\Disable"
#string STR_LPSS_PWM1_PROMPT   					#language eng "LPSS PWM #1 Support"
#string STR_LPSS_PWM1_HELP   						#language eng "LPSS PWM #1 Support  Enable\Disable"
#string STR_LPSS_PWM2_PROMPT   					#language eng "LPSS PWM #2 Support"
#string STR_LPSS_PWM2_HELP   						#language eng "LPSS PWM #2 Support  Enable\Disable"
#string STR_LPSS_SPI_PROMPT   					#language eng "LPSS SPI Support"
#string STR_LPSS_SPI_HELP   						#language eng "LPSS SPISupport Enable\Disable"

//EIP158981 >>
#string STR_LPSS_I2C7_NFC_PROMPT                    #language eng "  NFC"
#string STR_LPSS_I2C7_NFC_HELP                      #language eng "Enable/Disable NFC"
#string STR_LPSS_I2C7_TOUCH_PAD_PROMPT              #language eng "  Touch Pad"
#string STR_LPSS_I2C7_TOUCH_PAD_HELP                #language eng "Enable/Disable Touch Pad"
#string STR_LPSS_I2C_TOUGCH_ADDRESS_PROMPT          #language eng "I2C touch Device Address"
#string STR_LPSS_I2C_TOUGCH_ADDRESS_HELP            #language eng "I2C touch address, 0x4B:RVP   0x4A:FFRD"
#string STR_LPSS_I2C_TOUGCH_ADDRESS_AUTO            #language eng "AUTO"
#string STR_LPSS_I2C_TOUGCH_ADDRESS_RVP             #language eng "0x4B"
#string STR_LPSS_I2C_TOUGCH_ADDRESS_FFRD            #language eng "0x4A"
//EIP158981 <<

//---------------------------------------------------------------------------
// Miscellaneous Configuration
//---------------------------------------------------------------------------
#string STR_MISCELLANEOUS_CONFIG_FORM        		#language eng "Miscellaneous Configuration"
#string STR_MISCELLANEOUS_CONFIG_FORM_HELP   		#language eng "Enable\Disable Misc. Features"

#string STR_MISCELLANEOUS_CONFIG_TITLE   				#language eng "Miscellaneous Configuration"

//EIP150027 >>
#string STR_ACPI_PCIE_NATIVE_PROMPT                 #language eng "Native PCIE Enable"
#string STR_ACPI_PCIE_NATIVE_HELP                   #language eng "PCI Express Native Support Enable/Disable. This feature is only available in Vista."

#string STR_NATIVE_ASPM_PROMPT                      #language eng "Native ASPM"
#string STR_NATIVE_ASPM_HELP                        #language eng "On enable, Vista will control the ASPM support for the device. If disabled, the BIOS will."
//EIP150027 <<

#string STR_HIGHT_PRECISION_TIMER_PROMPT   			#language eng "High Precision Timer"
#string STR_HIGHT_PRECISION_TIMER_HELP   				#language eng "Enable or Disable the Hight Precision Event Timer"
#string STR_BOOT_TIMER_WITH_HPET_TIMER_PROMPT   #language eng "Boot Timer with HPET Timer"
#string STR_BOOT_TIMER_WITH_HPET_TIMER_HELP   	#language eng "Boot time calculation with Hight Precision Event Timer Enabled"
#string STR_STATE_AFTER_G3_PROMPT   						#language eng "State After G3"
#string STR_STATE_AFTER_G3_HELP   							#language eng "Specify what state to go to when power is re-applied after a power failure (G3 state)"
#string STR_STATE_AFTER_G3_S0   							  #language eng "S0 State"
#string STR_STATE_AFTER_G3_S5   							  #language eng "S5 State"
#string STR_CLOCK_SPREAD_SPECTRUM_PROMPT   			#language eng "Clock Spread Spectrum"
#string STR_CLOCK_SPREAD_SPECTRUM_HELP   				#language eng "Enable Clock Chip's Spread Spectrum feature"

//EIP133060 >>
#string STR_UART_DEBUG_SELECTION_PROMPT   	#language eng "Use internal UART to output debug message in OS"
#string STR_UART_DEBUG_SELECTION_HELP   		#language eng "Enable:Use internal UART to output debug message in OS; Disable:No use internal UART to output debug message in OS"
//EIP133060 <<

#string STR_NFC_INTERFACE_SELECTION_PROMPT   	#language eng "NFC Interface Selection"
#string STR_NFC_INTERFACE_SELECTION_HELP   		#language eng "Select which NFC interface to use"
#string STR_NFC_INTERFACE_DISAABLE_NFC 				#language eng "Disable NFC devices"
#string STR_NFC_INTERFACE_SELECTION_NFC1   			#language eng "Select the NFC 1"
#string STR_NFC_INTERFACE_SELECTION_NFC2   			#language eng "Select the NFC 2"

#string STR_LAST_STATE_PROMPT                   #language eng "Restore AC Power Loss"
#string STR_LAST_STATE_HELP                     #language eng "Select AC power state when power is re-applied after a power failure."
#string STR_POWER_ON                            #language eng "Power On"
#string STR_POWER_OFF                           #language eng "Power Off"
#string STR_LAST_STATE                          #language eng "Last State"

//EIP133059 >>
#string STR_PCH_IRQMODE_PROMPT                  #language eng "Serial IRQ Mode"
#string STR_PCH_IRQMODE_HELP                    #language eng "Configure Serial IRQ Mode."
#string STR_IRQ_QUIET                           #language eng "Quiet"
#string STR_IRQ_CONTINUOUS                      #language eng "Continuous"
//EIP133059 <<

//EIP158981 >>
//EIP150551 >>
#string STR_SB_CRID                      		#language eng  "Configured Revision ID Control"
#string STR_SB_CRID_HELP                 		#language eng  "Enable/Disable CRID control, BIOS updates CRID register in PMC with 0x01."
//EIP150551 <<
//EIP158981 <<

//---------------------------------------------------------------------------
// IDE Configuration
//---------------------------------------------------------------------------
#string STR_IDE_CONFIG_FORM             #language eng "IDE Configuration"
#string STR_IDE_CONFIG_FORM_HELP        #language eng "IDE Devices Configuration"
#string STR_IDE_MODE                    #language eng "IDE Mode"
#string STR_IDE_MODE_HELP               #language eng "Enhanced(Native) / Combined (Legacy) Mode "
#string STR_IDE_NON_COMBINED            #language eng "Enhanced (Native) Mode "
#string STR_IDE_COMBINED_PATA           #language eng "Combined (Legacy) Mode with PATA as Primary"
#string STR_IDE_COMBINED_SATA           #language eng "Combined (Legacy) Mode with SATA as Primary"
#string STR_PATA_MASTER_STRING          #language eng "PATA Master"
#string STR_PATA_MASTER_NAME            #language eng "Not Present"
#string STR_PATA_MASTER_HELP            #language eng "PATA Master Device Name if Present and Enable"
#string STR_PATA_SLAVE_STRING           #language eng "PATA Slave"
#string STR_PATA_SLAVE_NAME             #language eng "Not Present"
#string STR_PATA_SLAVE_HELP             #language eng "PATA Slave Device Name if Present and Enable"
#string STR_PATA_PROMPT                 #language eng "Parallel-ATA (PATA)"
#string STR_PATA_PROMPT_HELP            #language eng "Enable / Disable Parallel ATA"
#string STR_SATA_PROMPT                 #language eng "Serial-ATA (SATA)"
#string STR_SATA_PROMPT_HELP            #language eng "Enable / Disable Serial ATA"
#string STR_SATA_TEST_PROMPT            #language eng "SATA Test Mode"
#string STR_SATA_TEST_PROMPT_HELP       #language eng "Test Mode enable / disable."
#string STR_SATA_MODE                   #language eng "SATA Mode"
#string STR_SATA_MODE_HELP              #language eng "Select IDE / AHCI"
#string STR_SATA_IDE                    #language eng "IDE Mode"
#string STR_SATA_AHCI                   #language eng "AHCI Mode"
#string STR_SATA_RAID                   #language eng "RAID Mode"
#string STR_SATA_HELP                   #language eng "SATA Ports (0-3) Device Names if Present and Enabled."
#string STR_SATA_0_STRING               #language eng "SATA Port0"
#string STR_SATA_1_STRING               #language eng "SATA Port1"
#string STR_SATA_2_STRING               #language eng "SATA Port2"
#string STR_SATA_3_STRING               #language eng "SATA Port3"
#string STR_SATA_0_NAME                 #language eng "Not Present"
#string STR_SATA_1_NAME                 #language eng "Not Present"
#string STR_SATA_2_NAME                 #language eng "Not Present"
#string STR_SATA_3_NAME                 #language eng "Not Present"
#string STR_SATA_0_PROMPT               #language eng "Serial-ATA Port 0"
#string STR_SATA_1_PROMPT               #language eng "Serial-ATA Port 1"
#string STR_SATA_2_PROMPT               #language eng "Serial-ATA Port 2"
#string STR_SATA_3_PROMPT               #language eng "Serial-ATA Port 3"
#string STR_SATA_0_PROMPT_HELP          #language eng "Enable / Disable Serial ATA Port 0"
#string STR_SATA_1_PROMPT_HELP          #language eng "Enable / Disable Serial ATA Port 1"
#string STR_SATA_2_PROMPT_HELP          #language eng "Enable / Disable Serial ATA Port 2"
#string STR_SATA_3_PROMPT_HELP          #language eng "Enable / Disable Serial ATA Port 3"

//EIP144257 >>
#string STR_SATA_0_HOTPLUG_PROMPT       #language eng "SATA Port0 HotPlug"
#string STR_SATA_1_HOTPLUG_PROMPT       #language eng "SATA Port1 HotPlug"
#string STR_SATA_0_HOTPLUG_PROMPT_HELP  #language eng "Enable / Disable SATA Port0 HotPlug"
#string STR_SATA_1_HOTPLUG_PROMPT_HELP  #language eng "Enable / Disable SATA Port1 HotPlug"
//EIP144257 <<

//EIP147898 >>
#string STR_SATA_SPEED_SUPPORT_PROMPT      #language eng "SATA Speed Support"
#string STR_SATA_SPEED_SUPPORT_PROMPT_HELP #language eng "SATA Speed Support Gen1 or Gen2"
#string STR_COMMON_GEN1                    #language eng "Gen1"
#string STR_COMMON_GEN2                    #language eng "Gen2"
//EIP147898 <<

//EIP149024 >>
#string STR_SATA_ODD_PORT_PROMPT      #language eng "SATA ODD Port"
#string STR_SATA_ODD_PORT_PROMPT_HELP #language eng "SATA ODD is Port0 or Port1"
#string STR_COMMON_NO_ODD                    #language eng "No ODD"
#string STR_COMMON_ODD_PORT0                    #language eng "Port0 ODD"
#string STR_COMMON_ODD_PORT1                    #language eng "Port1 ODD"
//EIP149024 <<

//---------------------------------------------------------------------------
// Audio Configuration
//---------------------------------------------------------------------------
#string STR_AZALIA_AUDIO_FORM         		#language eng "Azalia HD Audio"
#string STR_AZALIA_AUDIO_FORM_HELP        #language eng "Azalia HD Audio Options"

#string STR_AUDIO_SUBTITLE              	#language eng "Audio Configuration"

#string STR_LPE_AUDIO_SUPPORT_PROMPT    	#language eng "LPE Audio Support"
#string STR_LPE_AUDIO_SUPPORT_HELP    		#language eng "Select LPE Audio ACPI mode or PCI mode"

#string STR_LPE_AUDIO_SUPPORT_PCI    		  #language eng "LPE Audio PCI mode"
#string STR_LPE_AUDIO_SUPPORT_ACPI    		#language eng "LPE Audio ACPI mode"

#string STR_AUDIO_CONTROLLER_PROMPT     	#language eng "Audio Controller"
#string STR_AUDIO_CONTROLLER_HELP    			#language eng "Control Detection of the Azalia device.   Disabled = Azalia will be unconditionally disabled.   Enabled = Azalia will be unconditionally Enabled.  Auto = Azalia will be enabled if present disabled otherwise."
#string STR_AZALIA_VCI_ENABLE_PROMPT    	#language eng "  Azalia VCi Enable"
#string STR_AZALIA_VCI_ENABLE_HELP    		#language eng "Enable/Disable Virtual Channel 1 of Audio Controller."
#string STR_AZALIA_DOCKING_ENABLE_PROMPT	#language eng "  Azalia Docking Support Enable"
#string STR_AZALIA_DOCKING_ENABLE_HELP    #language eng "Enable/Disable Azalia Docking Support of Audio Controller."
#string STR_AZALIA_PME_ENABLE_PROMPT      #language eng "  Azalia PME Enable"
#string STR_AZALIA_PME_ENABLE_HELP    		#language eng "Enable/Disable Power Management capability of Audio Controller."
#string STR_AZALIA_HDMI_ENABLE_PROMPT     #language eng "  Azalia HDMI Codec"
#string STR_AZALIA_HDMI_ENABLE_HELP    		#language eng "Enable/Disable internal HDMI codec for Azalia"
//EIP136267 >>
#string STR_HDMI_PORT_B_ENABLE_PROMPT     #language eng "    HDMI Port B"
#string STR_HDMI_PORT_B_ENABLE_HELP       #language eng "Enable/Disable HDMI Port B"
#string STR_HDMI_PORT_C_ENABLE_PROMPT     #language eng "    HDMI Port C"
#string STR_HDMI_PORT_C_ENABLE_HELP       #language eng "Enable/Disable HDMI Port C"
//EIP136267 <<

//---------------------------------------------------------------------------
// USB Configuration
//---------------------------------------------------------------------------
#string STR_USB_CONFIG_FORM             #language eng "USB Configuration"
#string STR_USB_CONFIG_FORM_HELP        #language eng "USB Configuration Settings"
#string STR_USB_SUBTITLE                #language eng "USB Configuration"

#string STR_USB_OTG_SUPPORT_PROMPT      #language eng "USB OTG Support"
#string STR_USB_OTG_SUPPORT_HELP      	#language eng "Enable/Disable USB OTG Support"
#string STR_USB_OTG_SUPPORT_PCI      		#language eng "PCI mode"
#string STR_USB_OTG_SUPPORT_ACPI      	#language eng "ACPI mode"
#string STR_USB_VBUS_PROMPT             #language eng "USB VBUS"
#string STR_USB_VBUS_HELP             	#language eng "VBUS Should be ON in HOST mode. It should be OFF in OTG device mode."

//CSP20130723_C >>
#string STR_XHCI_CONTROLLER_PROMPT      #language eng "Pre Boot Support"
#string STR_XHCI_CONTROLLER_HELP        #language eng "Enable/Disable Pre Boot Support"
#string STR_XHCI_MODE_PROMPT            #language eng "XHCI Mode"
#string STR_XHCI_MODE_HELP              #language eng "Mode of operation of xHCI controller"
#string STR_XHCI_SMART_AUTO        			#language eng "Smart Auto"

#string STR_XHCI_STREAMS_PROMPT         #language eng "XHCI Streams"
#string STR_XHCI_STREAMS_HELP           #language eng "Enable/Disable XHCI Streams"

#string STR_XHCI_LPM_PROMPT             #language eng "USB2 Link Power Management"
#string STR_XHCI_LPM_HELP               #language eng "Enable/Disable USB2 Link Power Management."
//CSP20130723_C <<

//P20130628 >>
#string STR_USB_EHCIDEBUG_PROMPT      #language eng "USB EHCI debug"
#string STR_USB_EHCIDEBUG_HELP        #language eng "Enable/Disable PCH EHCI debug capability "

#string STR_USB_PLL_CFG_ENABLE_PROMPT      #language eng "EHCI PLL Configure"
#string STR_USB_PLL_CFG_ENABLE_HELP        #language eng "Enable/Disable EHCI PLL Configure For RTD3"
//P20130628 <<

#string STR_EHCI_PROMPT                 #language eng "USB 2.0(EHCI) Support"
#string STR_EHCI_PROMPT_HELP            #language eng "Control the USB EHCI (USB 2.0) functions.  One EHCI controller must always be enabled"
#string STR_USB_RMH_MODE_PROMPT         #language eng "USB RMH Mode"
#string STR_USB_RMH_MODE_HELP           #language eng "Enable/Disable PCH USB Rate Matching Hubs mode"
#string STR_USB_PROMPT                  #language eng "USB Per Port Control"
#string STR_USB_PROMPT_HELP             #language eng "Control each of the USB ports (0~3). Enable:Enable USB per port; Disable: Use USB port X settings"
#string STR_USB_0_PROMPT               #language eng "USB Port 0"
#string STR_USB_0_PROMPT_HELP          #language eng "Enable / Disable USB Port 0"
#string STR_USB_1_PROMPT               #language eng "USB Port 1"
#string STR_USB_1_PROMPT_HELP          #language eng "Enable / Disable USB Port 1"
#string STR_USB_2_PROMPT               #language eng "USB Port 2"
#string STR_USB_2_PROMPT_HELP          #language eng "Enable / Disable USB Port 2"
#string STR_USB_3_PROMPT               #language eng "USB Port 3"
#string STR_USB_3_PROMPT_HELP          #language eng "Enable / Disable USB Port 3"

//---------------------------------------------------------------------------
// PCI Express Ports Configuration
//---------------------------------------------------------------------------
#string STR_PCIE_OPTIONS_FORM_TITLE             #language eng "PCI Express Configuration"
#string STR_PCIE_OPTIONS_FORM_HELP              #language eng "PCI Express Configuration settings"
#string STR_PCIE_ROOT_PORT_TITLE                #language eng "PCI Express Root Port Setting"

#string STR_PCIE_PORTS_SUBTITLE         #language eng "PCI Express Ports Configuration"
#string STR_PCIE_PORT_0_PROMPT          #language eng "PCI Express Port 0"
#string STR_PCIE_PORT_1_PROMPT          #language eng "PCI Express Port 1"
#string STR_PCIE_PORT_2_PROMPT          #language eng "PCI Express Port 2"
#string STR_PCIE_PORT_3_PROMPT          #language eng "PCI Express Port 3"
#string STR_PCIE_PORT_4_PROMPT          #language eng "PCI Express Port 4"
#string STR_PCIE_PORT_5_PROMPT          #language eng "PCI Express Port 5"
#string STR_PCIE_PORT_0_PROMPT_HELP     #language eng "Enable or Disable the PCI Express Port 0 in the Chipset."
#string STR_PCIE_PORT_1_PROMPT_HELP     #language eng "Enable or Disable the PCI Express Port 1 in the Chipset."
#string STR_PCIE_PORT_2_PROMPT_HELP     #language eng "Enable or Disable the PCI Express Port 2 in the Chipset."
#string STR_PCIE_PORT_3_PROMPT_HELP     #language eng "Enable or Disable the PCI Express Port 3 in the Chipset."
#string STR_PCIE_PORT_4_PROMPT_HELP     #language eng "Enable or Disable the PCI Express Port 4 in the Chipset."
#string STR_PCIE_PORT_5_PROMPT_HELP     #language eng "Enable or Disable the PCI Express Port 5 in the Chipset."

#string STR_PCIE_PORT_SPEED_PROMPT    #language eng "  Speed"
#string STR_PCIE_PORT_SPEED_HELP      #language eng "Configure PCIe Port Speed"

#string STR_PCIE_PORT_SPEED_GEN1    #language eng "Gen 1"
#string STR_PCIE_PORT_SPEED_GEN2    #language eng "Gen 2"

#string STR_PCH_PCIE_NON_COMPLIANCE_PROMPT      #language eng "Detect Non-Compliance Device"
#string STR_PCH_PCIE_NON_COMPLIANCE_HELP        #language eng "Detect Non-Compliance PCI Express Device. If enable, it will take more time at POST time."

#string STR_PCH_PCIE_ASPM_PROMPT                #language eng "  ASPM"
#string STR_PCH_PCIE_ASPM_HELP                  #language eng "PCI Express Active State Power Management settings."
#string STR_PCH_PCIE_ASPM_L0S_STRING            #language eng "L0s"
#string STR_PCH_PCIE_ASPM_L1_STRING             #language eng "L1"
#string STR_PCH_PCIE_ASPM_L0SL1_STRING          #language eng "L0sL1"

#string STR_PCIE_EXT_SYNCH_PROMPT               #language eng "  Extended Synch"
#string STR_PCIE_EXT_SYNCH_HELP                 #language eng "Enable PCIe Extended Synchronization for Logic Analyzer use."

#string STR_PCH_PCIE_URE_PROMPT                 #language eng "  URR"
#string STR_PCH_PCIE_URE_HELP                   #language eng "Enable or disable PCI Express Unsupported Request Reporting."

#string STR_PCH_PCIE_FEE_PROMPT                 #language eng "  FER"
#string STR_PCH_PCIE_FEE_HELP                   #language eng "Enable or disable PCI Express Device Fatal Error Reporting."

#string STR_PCH_PCIE_NFE_PROMPT                 #language eng "  NFER"
#string STR_PCH_PCIE_NFE_HELP                   #language eng "Enable or disable PCI Express Device Non-Fatal Error Reporting."
                                    
#string STR_PCH_PCIE_CEE_PROMPT                 #language eng "  CER"
#string STR_PCH_PCIE_CEE_HELP                   #language eng "Enable or disable PCI Express Device Correctable Error Reporting."
                                    
#string STR_PCH_PCIE_CTD_PROMPT                 #language eng "  CTO"
#string STR_PCH_PCIE_CTD_HELP                   #language eng "Enable or disable PCI Express Completion Timer TO."
                                    
#string STR_PCH_PCIE_SFE_PROMPT                 #language eng "  SEFE"
#string STR_PCH_PCIE_SFE_HELP                   #language eng "Enable or disable Root PCI Express System Error on Fatal Error."
                                    
#string STR_PCH_PCIE_SNE_PROMPT                 #language eng "  SENFE"
#string STR_PCH_PCIE_SNE_HELP                   #language eng "Enable or disable Root PCI Express System Error on Non-Fatal Error."
                                    
#string STR_PCH_PCIE_SCE_PROMPT                 #language eng "  SECE"
#string STR_PCH_PCIE_SCE_HELP                   #language eng "Enable or disable Root PCI Express System Error on Correctable Error."

#string STR_PCH_PCIE_PMCE_PROMPT                #language eng "  PME SCI"
#string STR_PCH_PCIE_PMCE_HELP                  #language eng "Enable or disable PCI Express PME SCI."

#string STR_PCH_PCIE_HPE_PROMPT                 #language eng "  Hot Plug"
#string STR_PCH_PCIE_HPE_HELP                   #language eng "Enable or disable PCI Express Hot Plug."

//EIP150027 >>
#string STR_PCH_PCIE_RBUS_PROMPT                #language eng "Extra Bus Reserved"
#string STR_PCH_PCIE_RBUS_HELP                  #language eng "Extra Bus Reserved (0-3) for bridges behind this Root Bridge."

#string STR_PCH_PCIE_RMEM_PROMPT                #language eng "Reseved Memory"
#string STR_PCH_PCIE_RMEM_HELP                  #language eng "Reserved Memory Range for this Root Bridge."

#string STR_PCH_PCIE_RMEM_ALIG_PROMPT           #language eng "Reseved Memory Alignment"
#string STR_PCH_PCIE_RMEM_ALIG_HELP             #language eng "Reseved Memory Alignment (0 - 31 bits)"

#string STR_PCH_PCIE_PF_RMEM_PROMPT             #language eng "Prefetchable Memory"
#string STR_PCH_PCIE_PF_RMEM_HELP               #language eng "Prefetchable Memory Range for this Root Bridge."

#string STR_PCH_PCIE_PF_RMEM_ALIG_PROMPT        #language eng "Prefetchable Memory Alignment"
#string STR_PCH_PCIE_PF_RMEM_ALIG_HELP          #language eng "Prefetchable Memory Alignment (0 - 31 bits)"

#string STR_PCH_PCIE_RVIO_PROMPT                #language eng "Reserved I/O"
#string STR_PCH_PCIE_RVIO_HELP                  #language eng "Reserved I/O (4K/8K/12K/16K/.../48K) Range for this Root Bridge."
//EIP150027 <<

//---------------------------------------------------------------------------
// LAN Configuration
//---------------------------------------------------------------------------
#string STR_LAN_SUBTITLE              	#language eng "LAN Configuration"
#string STR_LAN_FORM         						#language eng "LAN Controller"
#string STR_LAN_FORM_HELP        				#language eng "LAN Controller Settings"

#string STR_LAN_CONTROLLER_PROMPT           #language eng "LAN Controller"
#string STR_LAN_CONTROLLER_HELP             #language eng "Enable or disable onboard NIC."
#string STR_LAN_WOL_PROMPT                  #language eng "  Wake on LAN Enable"
#string STR_LAN_WOL_HELP                    #language eng "Enable/Disable integrated LAN to wake the system."
#string STR_LAN_SLP_LAN_PROMPT              #language eng "  SLP_LAN# Low on DC Power"
#string STR_LAN_SLP_LAN_HELP                #language eng "Enable/Disable SLP_LAN# Low on DC Power"
#string STR_LAN_PXE_PROMPT               		#language eng "PXE ROM"
#string STR_LAN_PXE_HELP                    #language eng "Enable/Disable  PXE Option ROM execution for onboard LAN."

//---------------------------------------------------------------------------
// HPET Configuration
//---------------------------------------------------------------------------
#string STR_HPET_PROMPT                 #language eng "High Precision Timer"
#string STR_HPET_HELP                   #language eng "Enable or Disable the High Precision Event Timer."
#string STR_HPET_SUBTITLE               #language eng "High Precision Event Timer Configuration"

//---------------------------------------------------------------------------
// PMIC & Battery Configuration
//---------------------------------------------------------------------------
#string STR_SYSTEM_COMPONENT_PROMPT       #language eng "System Component"
#string STR_SYSTEM_COMPONENT_HELP         #language eng "System Component settings"

#string STR_PMIC_SUBTITLE                 #language eng "PMIC Configureation"
#string STR_PMIC_ACPI_PROMT               #language eng "PMIC ACPI OBJECT"
#string STR_PMIC_ACPI_HELP                #language eng "Enable/Disable PMIC ACPI Device"

#string STR_PNP_SETTING_PROMT             #language eng "PNP Setting"
#string STR_PNP_SETTING_HELP              #language eng "Select PNP setting mode. Disable, Performance, Power or Power&Performance mode"
#string STR_PNP_SETTING_PERFORMANCE       #language eng "Performance"
#string STR_PNP_SETTING_POWER             #language eng "Power"
#string STR_PNP_SETTING_POWER_PERFORMANCE #language eng "Power&Performance"
#string STR_PNP_SETTING_AUTO #language eng "AUTO"
#string STR_PNP_SETTING_AX #language eng "AX STEPPING"
#string STR_PNP_SETTING_BX #language eng "BX STEPPING"

#string STR_BATTERY_SUBTITLE              #language eng "Battery Charging Configureation"
#string STR_BATTERY_SOLUTION_PROMT        #language eng "Battery Solution"
#string STR_BATTERY_SOLUTION_HELP         #language eng "If it does not match, battery will not properly."
#string STR_BATTERY_SOLUTION_ULPMC        #language eng "ULPMC solution"
#string STR_BATTERY_SOLUTION_NON_ULPMC    #language eng "Non ULPMC solution"

#string STR_WITTENABLE_SETTING_PROMT        #language eng "Witt Setting"
#string STR_WITTENABLE_SETTING_HELP         #language eng "Witt Configureation. Enable Test Device connected to I2C and URT for WHCK test."

//----------------------------------------------------------------------------
//EIP130725 >>
#string STR_BIOS_WPD_PROMPT				#language eng "BIOS Read/Write Protection"
#string STR_BIOS_WPD_HELP				#language eng "Enable or Disable BIOS SPI region read/write protect."
//EIP130725 <<

//EIP144291 >>
#string STR_GLOBAL_SMI_PROMPT             #language eng "Global SMI Lock"
#string STR_GLOBAL_SMI_HELP               #language eng "Enable or Disable SMI lock."
//EIP144291 <<

//EIP140009 >>
#string STR_PSS_SUPPORT_PROMT             #language eng "Pss Support"
#string STR_PSS_SUPPORT_HELP              #language eng "Enable or Disable Pss Support."
//EIP140009 <<

#string STR_PCIE_DYNAMIC_GATING_PROMPT        #language eng "PCI Express Dynamic Clock Gating"
#string STR_PCIE_DYNAMIC_GATING_HELP          #language eng "Enable/Disable PCIE Dynamic Clock Gating."

//----------------------------------------------------------------------------
// Common String
//----------------------------------------------------------------------------
#string STR_COMMON_AUTO              		#language eng "Auto"
#string STR_COMMON_ENABLED              #language eng "Enabled"
#string STR_COMMON_DISABLED             #language eng "Disabled"
#string STR_COMMON_ON              			#language eng "On"
#string STR_COMMON_OFF             			#language eng "Off"

//#string <string name>                 #language eng ""

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2011, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
